Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/maximum_fines_on_summary_conviction.html.txt.tmx
Source language: en
Languages: ga

source: Maximum fines on summary conviction
ga: Fíneálacha uasta ar ciontú achomair

source: A summary offence is one which can only be dealt with by a judge sitting without a jury, that is, in the District Court
ga: Ciontú achomair is ea ciontú nach féidir ach le breitheamh déileáil leis a shuíonn gan ghiúiré, is é sin, sa Chúirt Dúiche

source: Under the Fines Act 2010, since January 2011 there are 5 categories or classes of maximum fine applying to summary convictions
ga: Faoin Acht Fíneálacha, 2010, ó Eanáir 2011, is ann do 5 chatagóir nó aicme d’fhíneáil uasta a bhaineann le ciontuithe achomair

source: If someone is liable on summary conviction to a particular class of fine, the maximum fine is as given below
ga: Má tá duine faoi dhliteanas ar ciontú achomair fíneáil d’aicme áirithe a íoc, tugtar thíos an fhíneáil uasta

source: For example, the maximum fine for class B is €4,000
ga: Mar shampla, is é €4,000 an fhíneáil uasta d'aicme B

source: │Fine Class │A │B │C │D │E │
ga: │Aicme fíneála │A │B │C │D │E │

source: │Maximum fine │€5,000 │€4,000 │€2,500 │€1,000 │€500 │
ga: │Fíneáil Uasta │€5,000 │€4,000 │€2,500 │€1,000 │€500 │

source: Maximum fines enacted before 2011
ga: Fíneálacha uasta arna n-achtú roimh 2011

source: If the maximum fine on summary conviction for a particular offence was enacted or set before January 2011, it will now fit into one of the fine classes
ga: Má achtaíodh nó má shocraíodh an fhíneáil uasta ar ciontú achomair le haghaidh cion áirithe roimh Eanáir 2011, rangaítear anois í faoi cheann de na haicmí fíneála

source: Which fine class it belongs to depends on when the fine was set and the amount the maximum fine was set at
ga: Braitheann an t-aicme fíneála lena mbaineann sí ar cathain a socraíodh an fhíneáil ar an méid ar ar socraíodh an fhíneáil uasta dó

source: For example, if legislation (an act or statutory instrument) set the maximum fine on summary conviction for a particular offence at €500 in 1992, a class D fine now applies
ga: Mar shampla, má shocraigh an reachtaíocht (acht nó ionstraim reachtúil) an fhíneáil uasta ar ciontú achomair le haghaidh cion áirithe ag €500 i 1992, baineann fíneáil aicme D anois

source: │Set in period │Fine (€) │Fine (€) │Fine (€) │Fine (€) │Fine (€) │
ga: │Tréimhse ionsuite │Fíneáil (€) │Fíneáil (€) │Fíneáil (€) │Fíneáil (€) │Fíneáil (€) │

source: Indictable offences tried summarily
ga: Ciontuithe indíotáilte a thriailtear go hachomair

source: An indictable offence is one which may be or must be tried before a judge and jury, that is, in the Circuit Court or the Central Criminal Court
ga: Ciallaíonn cion indíotáilte cion nach mór nó a fhéadtar a thriail os comhair breithimh agus giúiré, is é sin, sa Chúirt Chuarda nó sa Phríomh-Chúirt Choiriúil

source: Where an indictable offence is tried summarily the maximum fine that applies is a class A fine
ga: Sa chás go dtriailtear cion indíotáilte go hachomair, is é fíneáil aicme A an fhíneáil uasta lena mbaineann

source: Maximum fines if convicted on indictment
ga: Fíneálacha uasta má chiontaítear thú ar díotáil

source: If the maximum fine for conviction on indictment for a particular offence was set on or after 1997, it is still the maximum fine for that offence
ga: Má socraíodh an fhíneáil uasta le haghaidh ciontú ar díotáil le haghaidh cion áirithe i 1997 nó tráth dá éis sin, is í sin an fhíneáil uasta don chion sin go fóill

source: If the maximum fine was set before then, the value it was set at is multiplied by the appropriate multiplier, as given in the table below, to find the current value of the maximum fine
ga: Má socraíodh an fhíneáil uasta roimhe sin, méadaítear an luach ar ar socraíodh í faoin iolraitheoir cuí, amhail a thugtar sa tábla thíos, d’fhonn luach reath na fíneála uasta a dheimhniú

source: For example, if the maximum fine was set at €5,000 in 1984, you multiply by 2 to obtain the current value of €10,000
ga: Mar shampla, más ionann agus €5,000 a socraíodh an fhíneáil uasta i 1984, iolraítear faoi 2 é seo le luach reatha €10,000 na fíneála a fháil
